### Aula-02-10-Agosto-2021-Dicionarios-DataFrames-Noite

In [1]:
d = { 'Paulo': 13, 'Jessica': 20, 'Danilo': 19 }

In [2]:
type(d)

dict

In [3]:
d['Jessica']

20

In [4]:
d.items()

dict_items([('Paulo', 13), ('Jessica', 20), ('Danilo', 19)])

In [5]:
d.keys()

dict_keys(['Paulo', 'Jessica', 'Danilo'])

In [6]:
d.values()

dict_values([13, 20, 19])

In [7]:
d['Mariana'] = 19

In [8]:
d

{'Paulo': 13, 'Jessica': 20, 'Danilo': 19, 'Mariana': 19}

In [9]:
d2 = { 10: True, 'CCT': 'UEPB'}
d2

{10: True, 'CCT': 'UEPB'}

In [10]:
d2[10]

True

In [11]:
d.update(d2)
d

{'Paulo': 13,
 'Jessica': 20,
 'Danilo': 19,
 'Mariana': 19,
 10: True,
 'CCT': 'UEPB'}

In [12]:
d['Endereco'] = ['Av. Baraunas', 365, "Bodocongó" ]
d

{'Paulo': 13,
 'Jessica': 20,
 'Danilo': 19,
 'Mariana': 19,
 10: True,
 'CCT': 'UEPB',
 'Endereco': ['Av. Baraunas', 365, 'Bodocongó']}

In [13]:
numero = d['Endereco'][1]
numero

365

In [14]:
d['Endereco2'] = {'rua':'Av. Baraunas', 'numero':365, 'Bairro':"Bodocongó" }
d

{'Paulo': 13,
 'Jessica': 20,
 'Danilo': 19,
 'Mariana': 19,
 10: True,
 'CCT': 'UEPB',
 'Endereco': ['Av. Baraunas', 365, 'Bodocongó'],
 'Endereco2': {'rua': 'Av. Baraunas', 'numero': 365, 'Bairro': 'Bodocongó'}}

In [16]:
numero = d['Endereco2']['numero']
numero

365

In [17]:
d.keys()

dict_keys(['Paulo', 'Jessica', 'Danilo', 'Mariana', 10, 'CCT', 'Endereco', 'Endereco2'])

In [18]:
d.values()

dict_values([13, 20, 19, 19, True, 'UEPB', ['Av. Baraunas', 365, 'Bodocongó'], {'rua': 'Av. Baraunas', 'numero': 365, 'Bairro': 'Bodocongó'}])

In [19]:
d['Paulo'] = d['Paulo'] + 10
d

{'Paulo': 23,
 'Jessica': 20,
 'Danilo': 19,
 'Mariana': 19,
 10: True,
 'CCT': 'UEPB',
 'Endereco': ['Av. Baraunas', 365, 'Bodocongó'],
 'Endereco2': {'rua': 'Av. Baraunas', 'numero': 365, 'Bairro': 'Bodocongó'}}

In [20]:
d['Paulo'] +=  10
d

{'Paulo': 33,
 'Jessica': 20,
 'Danilo': 19,
 'Mariana': 19,
 10: True,
 'CCT': 'UEPB',
 'Endereco': ['Av. Baraunas', 365, 'Bodocongó'],
 'Endereco2': {'rua': 'Av. Baraunas', 'numero': 365, 'Bairro': 'Bodocongó'}}

# Expressões Lambda

In [21]:
def potencia(x):
    return x * x

potencia(3)

9

In [22]:
pot = lambda x : x * x

In [23]:
pot(4)

16

In [24]:
addNum = lambda x,y : x + y

In [25]:
addNum(2,3)

5

# Comando for

In [26]:
range(10)

range(0, 10)

In [27]:
list(range(10))

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

In [28]:
for i in range(10):
    print(i)

0
1
2
3
4
5
6
7
8
9

In [29]:
l = [True, 'uepb', 10, 3.14, 'CCT']
l

[True, 'uepb', 10, 3.14, 'CCT']

In [30]:
for elem in l:
    print(elem)

True
uepb
10
3.14
CCT

In [31]:
c = 0
while c < 10:
    print(c)
    c += 1

0
1
2
3
4
5
6
7
8
9

In [32]:
c = 0
while c < 100:
    print(c)
    c += 1
    if c == 7:
        break
        
print(c)

0
1
2
3
4
5
6
7

In [33]:
d

{'Paulo': 33,
 'Jessica': 20,
 'Danilo': 19,
 'Mariana': 19,
 10: True,
 'CCT': 'UEPB',
 'Endereco': ['Av. Baraunas', 365, 'Bodocongó'],
 'Endereco2': {'rua': 'Av. Baraunas', 'numero': 365, 'Bairro': 'Bodocongó'}}

In [36]:
d.keys()

dict_keys(['Paulo', 'Jessica', 'Danilo', 'Mariana', 10, 'CCT', 'Endereco', 'Endereco2'])

In [39]:
for elem in d.keys():
    print(elem)

Paulo
Jessica
Danilo
Mariana
10
CCT
Endereco
Endereco2

In [40]:
for elem in d.values():
    print(elem)

33
20
19
19
True
UEPB
['Av. Baraunas', 365, 'Bodocongó']
{'rua': 'Av. Baraunas', 'numero': 365, 'Bairro': 'Bodocongó'}

In [41]:
d.items()

dict_items([('Paulo', 33), ('Jessica', 20), ('Danilo', 19), ('Mariana', 19), (10, True), ('CCT', 'UEPB'), ('Endereco', ['Av. Baraunas', 365, 'Bodocongó']), ('Endereco2', {'rua': 'Av. Baraunas', 'numero': 365, 'Bairro': 'Bodocongó'})])

In [42]:
for chave, valor in d.items():
    print(chave, ' : ',valor)

Paulo  :  33
Jessica  :  20
Danilo  :  19
Mariana  :  19
10  :  True
CCT  :  UEPB
Endereco  :  ['Av. Baraunas', 365, 'Bodocongó']
Endereco2  :  {'rua': 'Av. Baraunas', 'numero': 365, 'Bairro': 'Bodocongó'}

# Dataframes

In [43]:
import pandas as pd

In [44]:
df = pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

In [45]:
type(df)

pandas.core.frame.DataFrame

In [46]:
df['nome'] = [ 'Pedro', 'Joana']
df

    nome
0  Pedro
1  Joana

In [47]:
df['idade'] = [ 19, 22]
df

    nome  idade
0  Pedro     19
1  Joana     22

In [48]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   nome    2 non-null      object
 1   idade   2 non-null      int64
dtypes: int64(1), object(1)
memory usage: 160.0+ bytes

In [ ]:
Posicao,Pais,Total
1,United States of America,113
2,China,88
3,Japan,58
4,Great Britain, 65
12,Brazil,12

In [49]:
data = {
    'Posicao': [1, 2, 3, 4, 12],
    'Pais': [ 'USA', 'China', 'Japan', 'UK', 'Brazil' ],
    'Total': [113, 88, 58, 65, 12]    
}
data

{'Posicao': [1, 2, 3, 4, 12],
 'Pais': ['USA', 'China', 'Japan', 'UK', 'Brazil'],
 'Total': [113, 88, 58, 65, 12]}

In [50]:
type(data)

dict

In [51]:
df = pd.DataFrame(data)
df

   Posicao    Pais  Total
0        1     USA    113
1        2   China     88
2        3   Japan     58
3        4      UK     65
4       12  Brazil     12

In [52]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Posicao  5 non-null      int64
 1   Pais     5 non-null      object
 2   Total    5 non-null      int64
dtypes: int64(2), object(1)
memory usage: 248.0+ bytes

In [53]:
df.Pais

0       USA
1     China
2     Japan
3        UK
4    Brazil
Name: Pais, dtype: object

In [54]:
df['Pais']

0       USA
1     China
2     Japan
3        UK
4    Brazil
Name: Pais, dtype: object

In [55]:
df.Total

0    113
1     88
2     58
3     65
4     12
Name: Total, dtype: int64

In [56]:
v = df.Total.values
v

array([113,  88,  58,  65,  12])

In [57]:
v[0]

113

In [58]:
df.Pais.values

array(['USA', 'China', 'Japan', 'UK', 'Brazil'], dtype=object)

In [59]:
df.columns

Index(['Posicao', 'Pais', 'Total'], dtype='object')

In [60]:
df.columns.values

array(['Posicao', 'Pais', 'Total'], dtype=object)

In [61]:
df2 =  df[ ['Pais', 'Total'] ]
df2

     Pais  Total
0     USA    113
1   China     88
2   Japan     58
3      UK     65
4  Brazil     12

## Leitura De DataFrame com url

In [62]:
url = 'https://raw.githubusercontent.com/vladimiralencar/Alunos-UEPB-TopicosEspeciaisEmBancoDeDados/master/Python-Para-Analise-de-Dados/Olympics2020Medals.csv'
url

'https://raw.githubusercontent.com/vladimiralencar/Alunos-UEPB-TopicosEspeciaisEmBancoDeDados/master/Python-Para-Analise-de-Dados/Olympics2020Medals.csv'

In [63]:
df = pd.read_csv(url)
df.head()

  Posicao                        Pais  Ouro  Prata  Bronze  Total  Rank_total
0       1    United States of America  39.0   41.0    33.0  113.0         1.0
1       2  People's Republic of China  38.0   32.0    18.0   88.0         2.0
2       3                       Japan  27.0   14.0    17.0   58.0         5.0
3       4               Great Britain  22.0   21.0    22.0   65.0         4.0
4       5                         ROC  20.0   28.0    23.0   71.0         3.0

In [64]:
df.tail()

   Posicao                  Pais  Ouro  Prata  Bronze  Total  Rank_total
92      86  Syrian Arab Republic   0.0    0.0     1.0    1.0        77.0
93       .                   NaN   NaN    NaN     NaN    NaN         NaN
94     NaN                   NaN   NaN    NaN     NaN    NaN         NaN
95     NaN                   NaN   NaN    NaN     NaN    NaN         NaN
96       .                   NaN   NaN    NaN     NaN    NaN         NaN

In [65]:
df.columns.values

array(['Posicao', 'Pais', 'Ouro', 'Prata', 'Bronze', 'Total',
       'Rank_total'], dtype=object)

In [66]:
atributos = df.columns.values
atributos

array(['Posicao', 'Pais', 'Ouro', 'Prata', 'Bronze', 'Total',
       'Rank_total'], dtype=object)

In [67]:
len(df)

97

In [68]:
df.head()

  Posicao                        Pais  Ouro  Prata  Bronze  Total  Rank_total
0       1    United States of America  39.0   41.0    33.0  113.0         1.0
1       2  People's Republic of China  38.0   32.0    18.0   88.0         2.0
2       3                       Japan  27.0   14.0    17.0   58.0         5.0
3       4               Great Britain  22.0   21.0    22.0   65.0         4.0
4       5                         ROC  20.0   28.0    23.0   71.0         3.0

In [69]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 97 entries, 0 to 96
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Posicao     95 non-null     object
 1   Pais        93 non-null     object
 2   Ouro        93 non-null     float64
 3   Prata       93 non-null     float64
 4   Bronze      93 non-null     float64
 5   Total       93 non-null     float64
 6   Rank_total  93 non-null     float64
dtypes: float64(5), object(2)
memory usage: 5.4+ KB

In [70]:
atributos

array(['Posicao', 'Pais', 'Ouro', 'Prata', 'Bronze', 'Total',
       'Rank_total'], dtype=object)

In [71]:
atributos[:-1]

array(['Posicao', 'Pais', 'Ouro', 'Prata', 'Bronze', 'Total'],
      dtype=object)

In [72]:
atrib = atributos[:-1]
atrib

array(['Posicao', 'Pais', 'Ouro', 'Prata', 'Bronze', 'Total'],
      dtype=object)

In [75]:
df2 = df[atrib]
df2.head(8)

  Posicao                        Pais  Ouro  Prata  Bronze  Total
0       1    United States of America  39.0   41.0    33.0  113.0
1       2  People's Republic of China  38.0   32.0    18.0   88.0
2       3                       Japan  27.0   14.0    17.0   58.0
3       4               Great Britain  22.0   21.0    22.0   65.0
4       5                         ROC  20.0   28.0    23.0   71.0
5       6                   Australia  17.0    7.0    22.0   46.0
6       7                 Netherlands  10.0   12.0    14.0   36.0
7       8                      France  10.0   12.0    11.0   33.0

In [76]:
df.describe()

            Ouro      Prata     Bronze       Total  Rank_total
count  93.000000  93.000000  93.000000   93.000000   93.000000
mean    3.655914   3.634409   4.322581   11.612903   43.494624
std     7.022471   6.626339   6.210372   19.091332   24.171769
min     0.000000   0.000000   0.000000    1.000000    1.000000
25%     0.000000   0.000000   1.000000    2.000000   23.000000
50%     1.000000   1.000000   2.000000    4.000000   47.000000
75%     3.000000   4.000000   5.000000   11.000000   66.000000
max    39.000000  41.000000  33.000000  113.000000   77.000000

In [77]:
df.describe().T

            count       mean        std  min   25%   50%   75%    max
Ouro         93.0   3.655914   7.022471  0.0   0.0   1.0   3.0   39.0
Prata        93.0   3.634409   6.626339  0.0   0.0   1.0   4.0   41.0
Bronze       93.0   4.322581   6.210372  0.0   1.0   2.0   5.0   33.0
Total        93.0  11.612903  19.091332  1.0   2.0   4.0  11.0  113.0
Rank_total   93.0  43.494624  24.171769  1.0  23.0  47.0  66.0   77.0